---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Space.DesignOtherLoadperArea
source: html/1184e4a2-96bc-3c98-171b-f2116e2be023.htm
---
# Autodesk.Revit.DB.Mechanical.Space.DesignOtherLoadperArea Property

Get or set the Design Other Load per Area of the Space.

## Syntax (C#)
```csharp
public double DesignOtherLoadperArea { get; set; }
```

## Remarks
This property is used to get or set the Design Other Load per Area (Unit: W/ft2) of the Space.